Revit 2026 API

# Entity(Schema) Constructor

---

Creates a new Entity corresponding to the Schema.

**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Entity(
	Schema schema
)
```
```vb
Public Sub New (
	schema As Schema
)
```
```cpp
public:
Entity(
	Schema^ schema
)
```
```fsharp
new :
        schema : Schema -> Entity
```

#### Parameters

schema Schema

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | Writing of Entities of this Schema is not allowed to the current add-in. |

You can store the newly created Entity in an Element or in another Entity. If you do not have write access to the Schema, an exception will be thrown.

#### Reference

Entity Class

Entity Overload

Autodesk.Revit.DB.ExtensibleStorage Namespace